n, k = map(int, input().split())
tasks = 0
time = 0
s = 0

while tasks <= n and s <= 240:
    tasks += 1
    time = time + tasks * 5
    s = time + k
    
print(tasks - 1)

'''В последний день уходящего 2016 года Лимак собирается принять участие в соревновании по спортивному программированию. 
Соревнование начнётся в 20:00 и будет продолжаться четыре часа, то есть ровно до полуночи. Участникам будет предложено n задач, 
упорядоченных по возрастанию сложности, то есть задача 1 будет самой лёгкой, а задача номер n — самой сложной. Лимак знает, 
что ему потребуется 5·i минут на решение i-й задачи.

Друзья Лимака планирую устроить роскошную новогоднюю вечеринку и Лимак хочет прибыть в полночь или ранее.
Он знает, что ему требуется ровно k минут чтобы добрать до места проведения вечеринки от своего дома,
где он собирается участвовать в соревновании.

Сколько максимум задач может успеть решить Лимак, так чтобы не опоздать на новогоднюю вечеринку?'''
