#It is better to use sorted. But this is such a task.

a = list(map(int, input().split()))
b = list(map(int, input().split()))
c = list(map(int, input().split()))

lst = b + c
new_lst = []
l = len(lst)

while True:
    m = min(lst)
    new_lst.append(m)
    lst.remove(m)
    if len(new_lst) == l:
        print(*new_lst)
        break



'''В вашем распоряжении имеется два отсортированных списка по неубыванию элементов, состоящих из n и m элементов
Ваша задача слить их в один отсортированный список размером  n + m
Входные данные
Программа получает на вход два числа n и m - количество элементов первого списка и второго списков
Затем с новой строки поступают элементы первого отсортированного списка, а со следующей строки - второго списка
Выходные данные
Слить два списка в один в порядке неубывания и вывести элементы полученного списка
P.S: пользоваться встроенной сортировкой запрещено
Примечание: для вывода результирующего списка вы можете использовать следующую конструкцию'''
